uhnp/src/Enums/ВариантыИзмененияСоставаСтрахователейСФР/ВариантыИзмененияСоставаСтрахователейСФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИзмененияСоставаСтрахователейСФР</name>
  <enumValues>
    <name>НеМенялся</name>
  </enumValues>
  <enumValues>
    <name>ИзменилсяПолностью</name>
  </enumValues>
  <enumValues>
    <name>ИзменилсяЧастично</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыИзмененияСоставаСтрахователейСФР/ManagerModule.bsl
Функция СтрокаXML(Значение) Экспорт
	Если Значение = НеМенялся Тогда
		Возврат "same";
	
	ИначеЕсли Значение = ИзменилсяПолностью Тогда
		Возврат "other";
	
	ИначеЕсли Значение = ИзменилсяЧастично Тогда
		Возврат "mix";
	
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ЗначениеИзXML(СтрокаXML) Экспорт
	Если СтрСравнить(СтрокаXML, "same") = 0 Тогда
		Возврат НеМенялся;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "other") = 0 Тогда
		Возврат ИзменилсяПолностью;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "mix") = 0 Тогда
		Возврат ИзменилсяЧастично;
	
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции
